HideElementTemporary Method
 Set one element to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void HideElementTemporary(
	ElementId elementId
)
Visual Basic
Public Sub HideElementTemporary ( _
	elementId As ElementId _
)
Visual C++
public:
void HideElementTemporary(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DBElementId
 The id of the element to be temporarily hidden.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →